djsmisc/pinguino32/tools/share/sdcc/include/pic16/interrupt.c
/*	----------------------------------------------------------------------------
	---------- interrupt.c
	----------------------------------------------------------------------------
	@author				(c)2010 - R. Blanchot <rblanchot@gmail.com>
	@version			0.4 (last update 24-12-2010)
	@IDE				Pinguino IDE >= 9.5
	--------------------------------------------------------------------------*/

#ifndef __INTERRUPT
	#define __INTERRUPT

	#ifndef USERINT
		#define USERINT
	#endif

	#include <pic18fregs.h>

	#define INT_ENABLE			1
	#define INT_DISABLE			0
	#define INT_ENABLE_PRIORITY	1
	#define INT_DISABLE_PRIORITY 0
	#define INT_HIGH_PRIORITY	1
	#define INT_LOW_PRIORITY	0
	#define INT_RISING_EDGE		1			// Interrupt on rising edge
	#define INT_FALLING_EDGE	0			// Interrupt on falling edge
	#define INT_NOT_USED		0
	#define INT_USED			1
	#define INT_MICROSEC		1
	#define INT_MILLISEC		2
	#define INT_SEC				3

	/// Interrupts list

	#define INT_TMR0			0
	#define INT_TMR1			1
	#define INT_TMR2			2
	#define INT_TMR3			3

	#define INT_INT0			4
	#define INT_INT1			5
	#define INT_INT2			6
	#define INT_RB				7

	#define INT_CCP1			8
	#define INT_CCP2			9
	#define INT_CM				10

	#define INT_RC				11
	#define INT_TX				12
	#define INT_AD				13
	#define INT_OSCF			14
	#define INT_EE				15
	#define INT_HLVD			16
	#define INT_BCL				17
	#define INT_USB				18
	#define INT_SSP				19

	#define INT_NUM				20

	///
	/// CCPxCON: STANDARD CCPx CONTROL REGISTER
	///

	// bit 3-0 CCP1M3:CCP1M0: Enhanced CCP Mode Select bits
	#define CCP_RESET			0b11110000 // Capture/Compare/PWM off (resets ECCP module)
	#define CCP_MODE_TOGGLE		0b11110010 // Compare mode, toggle output on match
	#define CCP_FALLING_EDGE	0b11110100 // Capture mode, every falling edge
	#define CCP_RISING_EDGE 	0b11110101 // Capture mode, every rising edge
	#define CCP_4TH_RISING_EDGE	0b11110110 // Capture mode, every 4th rising edge
	#define CCP_16TH_RISING_EDGE 0b11110111 // Capture mode, every 16th rising edge
	#define CCP_INIT_PIN_LOW	0b11111000 // Compare mode, initialize CCP1 pin low, set output on compare match (set CCP1IF)
	#define CCP_INIT_PIN_HIGH	0b11111001 // Compare mode, initialize CCP1 pin high, clear output on compare match (set CCP1IF)
	#define CCP_INT_ON_CMP_MATCH 0b11111010 // Compare mode, generate software interrupt only, CCP1 pin reverts to I/O state
	#define CCP_SPECIAL_EVENT	0b11111011 // Compare mode, trigger special event (CCP1 resets TMR1 or TMR3, sets CCP1IF bit)

	///
	/// T0CON: TIMER0 CONTROL REGISTER
	///

	// bit 7
	#define T0_ON				0b11111111 // 1 = Enables Timer0
	#define T0_OFF				0b01111111 // 0 = Stops Timer0
	// bit 6   T08BIT: Timer0 8-Bit/16-Bit Control bit
	#define T0_8BIT				0b11111111 // 1 = Timer0 is configured as an 8-bit timer/counter
	#define T0_16BIT			0b10111111 // 0 = Timer0 is configured as a 16-bit timer/counter
	// bit 5   T0CS: Timer0 Clock Source Select bit
	#define	T0_CKI				0b11111111 // 1 = Transition on T0CKI pin
	#define	T0_CLK				0b11011111 // 0 = Internal instruction cycle clock (CLKO)
	// bit 4   T0SE: Timer0 Source Edge Select bit
	#define	T0_H2L				0b11111111 // 1 = Increment on high-to-low transition on T0CKI pin
	#define	T0_L2H				0b11101111 // 0 = Increment on low-to-high transition on T0CKI pin
	// bit 3   PSA: Timer0 Prescaler Assignment bit
	#define	T0_PS_OFF			0b11111111 // 1 = TImer0 prescaler is NOT assigned. Timer0 clock input bypasses prescaler.
	#define	T0_PS_ON			0b11110111 // 0 = Timer0 prescaler is assigned. Timer0 clock input comes from prescaler output.
	// bit 2-0 T0PS2:T0PS0: Timer0 Prescaler Select bits
	#define	T0_PS_1_256			0b11111111 // 1:256 Prescale value
	#define	T0_PS_1_128			0b11111110 // 1:128 Prescale value
	#define	T0_PS_1_64			0b11111101 // 1:64 Prescale value
	#define	T0_PS_1_32			0b11111100 // 1:32 Prescale value
	#define	T0_PS_1_16			0b11111011 // 1:16 Prescale value
	#define	T0_PS_1_8			0b11111010 // 1:8 Prescale value
	#define	T0_PS_1_4			0b11111001 // 1:4 Prescale value
	#define	T0_PS_1_2			0b11111000 // 1:2 Prescale value

	///
	/// T1CON: TIMER1 CONTROL REGISTER
	///

	// bit 7 RD16: 16-Bit Read/Write Mode Enable bit
	#define T1_16BIT			0b11111111	// 16-bit mode
	#define T1_8BIT				0b01111111	// 8-bit mode
	// bit 6 T1RUN: Timer1 System Clock Status bit
	#define T1_RUN_FROM_OSC		0b11111111 // 1 = Device clock is derived from Timer1 oscillator
	#define T1_RUN_FROM_ANOTHER	0b10111111 // 0 = Device clock is derived from another source
	// bit 5-4 T1CKPS1:T1CKPS0: Timer1 Input Clock Prescale Select bits
	#define T1_PS_1_1			0b11001111	// 1:1 prescale value
	#define T1_PS_1_2			0b11011111	// 1:2 prescale value
	#define T1_PS_1_4			0b11101111	// 1:4 prescale value
	#define T1_PS_1_8			0b11111111	// 1:8 prescale value
	// bit 3 T1OSCEN: Timer1 Oscillator Enable bit
	#define T1_OSC_OFF			0b11110111	// Timer 1 oscilator is shut off
	#define T1_OSC_ON			0b11111111	// Timer 1 oscilator enable on
	// bit 2 T1SYNC: Timer1 External Clock Input Synchronization Select bit
	#define T1_SYNC_EXT_ON		0b11111011	// Synchronize external clock input
	#define T1_SYNC_EXT_OFF		0b11111111	// Do not synchronize external clock input
	// bit 1 TMR1CS: Timer1 Clock Source Select bit
	#define T1_SOURCE_EXT		0b11111111	// 1 = External clock from RC0/T13CKI
	#define T1_SOURCE_INT		0b11111101	// 0 = Internal clock source (FOSC/4)
	// bit 0 TMR1ON: Timer1 On bit
	#define T1_ON				0b11111111	// 1 = Enables Timer1
	#define T1_OFF				0b11111110	// 0 = Stops Timer1

	///
	/// T2CON: TIMER2 CONTROL REGISTER
	///

	// bit 6-3 T2OUTPS3:T2OUTPS0: Timer2 Output Postscale Select bits
	#define T2_POST_1_1			0b00001111 // 1:1 Postscale
	#define T2_POST_1_2			0b00011111 // 1:2 Postscale
	#define T2_POST_1_3			0b00101111 // 1:3 Postscale
	#define T2_POST_1_4			0b00111111 // 1:4 Postscale
	#define T2_POST_1_5			0b01001111 // 1:5 Postscale
	#define T2_POST_1_6			0b01011111 // 1:6 Postscale
	#define T2_POST_1_7			0b01101111 // 1:7 Postscale
	#define T2_POST_1_8			0b01111111 // 1:7 Postscale
	#define T2_POST_1_9			0b10001111 // 1:8 Postscale
	#define T2_POST_1_10		0b10011111 // 1:9 Postscale
	#define T2_POST_1_11		0b10101111 // 1:10 Postscale
	#define T2_POST_1_12		0b10111111 // 1:11 Postscale
	#define T2_POST_1_13		0b11001111 // 1:12 Postscale
	#define T2_POST_1_14		0b11011111 // 1:13 Postscale
	#define T2_POST_1_15		0b11101111 // 1:14 Postscale
	#define T2_POST_1_16		0b11111111 // 1:15 Postscale
	//bit 2 TMR2ON: Timer2 On bit
	#define T2_ON				0b11111111 // Timer2 is on
	#define T2_OFF				0b11111011 // Timer2 is off
	// bit 1-0 T2CKPS1:T2CKPS0: Timer2 Clock Prescale Select bits
	#define T2_PS_1_1			0b11111100 // Prescaler is 1
	#define T2_PS_1_4			0b11111101 // Prescaler is 4
	#define T2_PS_1_16			0b11111111 // Prescaler is 16

	///
	/// T3CON: TIMER3 CONTROL REGISTER
	///
	
	// bit 7 RD16: 16-Bit Read/Write Mode Enable bit
	#define T3_16BIT			0b11111111 // 1 = Enables register read/write of Timer3 in one 16-bit operation
	#define T3_8BIT				0b01111111 // 0 = Enables register read/write of Timer3 in two 8-bit operations
	// bit 6, 3 T3CCP2:T3CCP1: Timer3 and Timer1 to CCPx Enable bits
	#define T3_CPP1_CCP2		0b11111111 // 1x = Timer3 is the capture/compare clock source for both CCP modules
	#define T3_CCP2_T1_CCP1		0b10111111 // 01 = Timer3 is the capture/compare clock source for CCP2; Timer1 is the capture/compare clock source for CCP1
	#define T1_CCP1_CCP2		0b10110111 // 00 = Timer1 is the capture/compare clock source for both CCP modules
	// bit 5-4 T3CKPS1:T3CKPS0: Timer3 Input Clock Prescale Select bits
	#define T3_PS_1_8			0b11111111 // 1:8 Prescale value
	#define T3_PS_1_4			0b11101111 // 1:4 Prescale value
	#define T3_PS_1_2			0b11011111 // 1:2 Prescale value
	#define T3_PS_1_1			0b11001111 // 1:1 Prescale value
	// bit 2 T3SYNC: Timer3 External Clock Input Synchronization Control bit
	// When TMR3CS = 1:
	#define T3_NOT_SYNC			0b11111111 // 1 = Do not synchronize external clock input
	#define T3_SYNC				0b11111011 // 0 = Synchronize external clock input
	// bit 1 TMR3CS: Timer3 Clock Source Select bit
	#define T3_EXT_CLK			0b11111111 // 1 = External clock input from Timer1 oscillator or T13CKI (on the rising edge after the first falling edge)
	#define T3_INT_CLK			0b11111101 // 0 = Internal clock (FOSC/4)
	// bit 0 TMR3ON: Timer3 On bit
	#define T3_ON				0b11111111 // 1 = Enables Timer3
	#define T3_OFF				0b11111110 // 0 = Stops Timer3

	typedef void (*callback) (void);				// type of: void callback()

	static callback intFunction[INT_NUM];
	u8  intUsed[INT_NUM];
	volatile u16 intCount[4];
	volatile u16 intCountLimit[4];
	volatile u8 preloadH[4];
	volatile u8 preloadL[4];

/*	----------------------------------------------------------------------------
	---------- OnTimerX
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		Configure timers to execute function func every delay ms, us or sec
	@param		timediv:	INT_MICROSEC, INT_MILLISEC, INT_SEC
				func:		function called when interrupt occures
				delay:		delay before overload (us)
	--------------------------------------------------------------------------*/

#ifdef TMR0INT
void OnTimer0(callback func, u8 timediv, u16 delay)
{
	u8 _t0con = 0;

	if (intUsed[INT_TMR0] == INT_NOT_USED)
	{
		intUsed[INT_TMR0] = INT_USED;
		intCount[INT_TMR0] = 0;
		intCountLimit[INT_TMR0] = delay;
		intFunction[INT_TMR0] = func;

		switch(timediv)
		{
			case INT_MICROSEC:
				// 1 us = 1.000 ns = 12 cy
				preloadH[INT_TMR0] = high8(0xFFFF - 12);
				preloadL[INT_TMR0] =  low8(0xFFFF - 12);
				_t0con = T0_ON & T0_16BIT & T0_CLK & T0_PS_OFF;
				break;
			case INT_MILLISEC:
				// 1 ms = 1.000.000 ns = 12.000 cy
				// 12.000 / 8 = 1.500
				preloadH[INT_TMR0] = high8(0xFFFF - 1500);
				preloadL[INT_TMR0] =  low8(0xFFFF - 1500);
				_t0con = T0_ON & T0_16BIT & T0_CLK & T0_PS_ON & T0_PS_1_8;
				break;
			case INT_SEC:
				// 1 sec = 1.000.000.000 ns = 12.000.000 cy
				// 12.000.000 / 256 = 46875
				preloadH[INT_TMR0] = high8(0xFFFF - 46875);
				preloadL[INT_TMR0] =  low8(0xFFFF - 46875);
				_t0con = T0_ON & T0_16BIT & T0_CLK & T0_PS_ON & T0_PS_1_256;
				break;
		}

