djsmisc/pinguino32/tools/share/sdcc/include/pic16/interrupt.c
		INTCON2bits.TMR0IP = INT_LOW_PRIORITY;
		INTCONbits.TMR0IE = INT_ENABLE;
		INTCONbits.TMR0IF = 0;
		TMR0H = preloadH[INT_TMR0];
		TMR0L = preloadL[INT_TMR0];
		T0CON = _t0con;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TIMER0 is already used !");
	}
	#endif
}
#endif

#ifdef TMR1INT
void OnTimer1(callback func, u8 timediv, u16 delay)
{
	u8 _t1con = 0;

	if (intUsed[INT_TMR1] == INT_NOT_USED)
	{
		intUsed[INT_TMR1] = INT_USED;
		intCount[INT_TMR1] = 0;
		intCountLimit[INT_TMR1] = delay;
		intFunction[INT_TMR1] = func;

		switch(timediv)
		{
			case INT_MICROSEC:
				// 1us = 1.000 ns = 12 cy
				preloadH[INT_TMR1] = high8(0xFFFF - 12);
				preloadL[INT_TMR1] =  low8(0xFFFF - 12);
				_t1con = T1_ON & T1_16BIT & T1_PS_1_1 & T1_RUN_FROM_ANOTHER & T1_OSC_OFF & T1_SYNC_EXT_OFF & T1_SOURCE_INT;
				break;
			case INT_MILLISEC:
				// 1ms = 1.000.000ns = 12.000 cy
				// 12.000 / 8 = 1.500
				preloadH[INT_TMR1] = high8(0xFFFF - 1500);
				preloadL[INT_TMR1] =  low8(0xFFFF - 1500);
				_t1con = T1_ON & T1_16BIT & T1_PS_1_8 & T1_RUN_FROM_ANOTHER & T1_OSC_OFF & T1_SYNC_EXT_OFF & T1_SOURCE_INT;
				break;
			case INT_SEC:
				// 1 sec = 1.000.000.000 ns = 12.000.000 cy
				// 12.000.000 / 8 = 1.500.000
				// 1.500.000 / 25 = 60000
				preloadH[INT_TMR1] = high8(0xFFFF - 60000); // 62500
				preloadL[INT_TMR1] =  low8(0xFFFF - 60000);
				intCountLimit[INT_TMR1] = delay * 25;
				_t1con = T1_ON & T1_16BIT & T1_PS_1_8 & T1_RUN_FROM_ANOTHER & T1_OSC_OFF & T1_SYNC_EXT_OFF & T1_SOURCE_INT;
				break;
		}

		IPR1bits.TMR1IP = INT_LOW_PRIORITY;
		PIE1bits.TMR1IE = INT_ENABLE;
		PIR1bits.TMR1IF = 0;
		TMR1H = preloadH[INT_TMR1];
		TMR1L = preloadL[INT_TMR1];
		T1CON = _t1con;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TIMER1 is already used !");
	}
	#endif
}
#endif

#ifdef TMR2INT
void OnTimer2(callback func, u8 timediv, u16 delay)
{
	u8 _t2con = 0;
	u8 _pr2 = 0;

	if (intUsed[INT_TMR2] == INT_NOT_USED)
	{
		intUsed[INT_TMR2] = INT_USED;
		intCount[INT_TMR2] = 0;
		intCountLimit[INT_TMR2] = delay;
		intFunction[INT_TMR2] = func;

		// time = Tcy*postscaler*pr2*prescaler
		switch(timediv)
		{
			case INT_MICROSEC:
				// 1us = 12 cy
				_pr2 = 12;
				_t2con = T2_ON & T2_PS_1_1 & T2_POST_1_1;
				break;
			case INT_MILLISEC:
				// 1ms = 12.000 cy
				// 12.000 / 15 / 16 = 50
				_pr2 = 50;
				_t2con = T2_ON & T2_POST_1_15 & T2_PS_1_16;
				break;
			case INT_SEC:
				// 1sec = 12.000.000 cy
				// 12.000.000 / 15 / 16 = 50.000 = 200 * 25
				_pr2 = 250;
				intCountLimit[INT_TMR2] = delay * 200;
				_t2con = T2_ON & T2_POST_1_15 & T2_PS_1_16;
				break;
		}

		IPR1bits.TMR2IP = INT_LOW_PRIORITY;
		PIE1bits.TMR2IE = INT_ENABLE;
		PIR1bits.TMR2IF = 0;
		PR2 = _pr2;	// Timer2 Match value
		T2CON = _t2con;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TIMER2 is already used !");
	}
	#endif
}
#endif

#ifdef TMR3INT
void OnTimer3(callback func, u8 timediv, u16 delay)
{
	u8 _t3con = 0;

	if (intUsed[INT_TMR3] == INT_NOT_USED)
	{
		intUsed[INT_TMR3] = INT_USED;
		intCount[INT_TMR3] = 0;
		intCountLimit[INT_TMR3] = delay;
		intFunction[INT_TMR3] = func;

		switch(timediv)
		{
			case INT_MICROSEC:
				// 1us = 1.000 ns = 12 cy
				preloadH[INT_TMR3] = high8(0xFFFF - 12);
				preloadL[INT_TMR3] =  low8(0xFFFF - 12);
				_t3con = T3_ON & T3_16BIT & T3_PS_1_1 & T3_INT_CLK;
				break;
			case INT_MILLISEC:
				// 1 ms = 1.000.000 ns = 12.000 cy
				// 12.000 / 8 = 1.500
				preloadH[INT_TMR3] = high8(0xFFFF - 1500);
				preloadL[INT_TMR3] =  low8(0xFFFF - 1500);
				_t3con = T3_ON & T3_16BIT & T3_PS_1_8 & T3_INT_CLK;
				break;
			case INT_SEC:
				// 1 sec = 1.000.000.000 ns = 12.000.000 cy
				// 12.000.000 / 8 = 1.500.000
				// 1.500.000 / 25 = 60000
				preloadH[INT_TMR3] = high8(0xFFFF - 60000);
				preloadL[INT_TMR3] =  low8(0xFFFF - 60000);
				intCountLimit[INT_TMR3] = delay * 25;
				_t3con = T3_ON & T3_16BIT & T3_PS_1_8 & T3_INT_CLK;
				break;
		}

		IPR2bits.TMR3IP = INT_LOW_PRIORITY;
		PIE2bits.TMR3IE = INT_ENABLE;
		PIR2bits.TMR3IF = 0;
		TMR3H = preloadH[INT_TMR3];
		TMR3L = preloadL[INT_TMR3];
		T3CON = _t3con;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TIMER3 is already used !");
	}
	#endif
}
#endif

/*	----------------------------------------------------------------------------
	---------- OnCounter
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		Configure counters
	@param		inter:		interrupt number (INT_TMR0, INT_TMR1, or INT_TMR3)
				func:		function called when interrupt comes
	--------------------------------------------------------------------------*/

#ifdef CNTR0INT
// Not available on Pinguino with 2 buttons (RA4 = Run Led)
void OnCounter0(callback func, u8 config)
{
	if (intUsed[INT_TMR0] == INT_NOT_USED)
	{
		intUsed[INT_TMR0] = INT_USED;
		intFunction[INT_TMR0] = func;
		intCount[INT_TMR0] = 0;
		intCountLimit[INT_TMR0] = 0;
		INTCON2bits.TMR0IP = INT_LOW_PRIORITY;
		INTCONbits.TMR0IE = INT_ENABLE;
		preloadH[INT_TMR0] = 0;
		preloadL[INT_TMR0] = 0;
		TMR0H = 0;
		TMR0L = 0;
		T0CON = T0_ON & T0_16BIT & T0_CKI & T0_L2H & T0_PS_ON & T0_PS_1_2;
		T0CON |= config;
		INTCONbits.TMR0IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TMR0 is already used !");
	}
	#endif
}
#endif

#ifdef CNTR1INT
void OnCounter1(callback func, u8 config)
{
	if (intUsed[INT_TMR1] == INT_NOT_USED)
	{
		intUsed[INT_TMR1] = INT_USED;
		intFunction[INT_TMR1] = func;
		intCount[INT_TMR1] = 0;
		intCountLimit[INT_TMR1] = 0;
		IPR1bits.TMR1IP = INT_LOW_PRIORITY;
		PIE1bits.TMR1IE = INT_ENABLE;
		preloadH[INT_TMR1] = 0;
		preloadL[INT_TMR1] = 0;
		TMR1H = 0;
		TMR1L = 0;
		T1CON = T1_ON & T1_16BIT & T1_PS_1_8 & T1_RUN_FROM_ANOTHER & T1_OSC_OFF & T1_SYNC_EXT_ON & T1_SOURCE_EXT;
		T1CON |= config;
		PIR1bits.TMR1IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TMR1 is already used !");
	}
	#endif
}
#endif

#ifdef CNTR3INT
void OnCounter3(callback func, u8 config)
{
	if (intUsed[INT_TMR3] == INT_NOT_USED)
	{
		intUsed[INT_TMR3] = INT_USED;
		intFunction[INT_TMR3] = func;
		intCount[INT_TMR3] = 0;
		intCountLimit[INT_TMR3] = 0;
		IPR2bits.TMR3IP = INT_LOW_PRIORITY;
		PIE2bits.TMR3IE = INT_ENABLE;
		preloadH[INT_TMR3] = 0;
		preloadL[INT_TMR3] = 0;
		TMR3H = 0;
		TMR3L = 0;
		T3CON = T3_ON & T3_16BIT & T3_PS_1_8 & T3_EXT_CLK; // default
		T3CON |= config;
		PIR2bits.TMR3IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt TMR3 is already used !");
	}
	#endif
}
#endif

/*	----------------------------------------------------------------------------
	---------- OnChange
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		Configure interrupt-on-change
	@param		inter:		interrupt number
				config:		INT_RISING_EDGE or INT_FALLING_EDGE
				func:		function called when interrupt comes
	--------------------------------------------------------------------------*/

#ifdef INT0INT
void OnChangePin0(callback func, u8 config)
{
	if (intUsed[INT_INT0] == INT_NOT_USED)
	{
		intUsed[INT_INT0] = INT_USED;
		intFunction[INT_INT0] = func;
		INTCON2bits.INTEDG0 = config;
		INTCON2bits.RBPU = 0;						// PORTB pull-ups are enabled
		TRISBbits.TRISB0 = INPUT;
		//INTCON3bits.INT0IP = INT_LOW_PRIORITY;
		INTCONbits.INT0IE = INT_ENABLE;
		INTCONbits.INT0IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt INT0 is already used !");
	}
	#endif
}
#endif

