djsmisc/pinguino32/tools/share/sdcc/include/pic16/interrupt.c
#ifdef INT1INT
void OnChangePin1(callback func, u8 config)
{
	if (intUsed[INT_INT1] == INT_NOT_USED)
	{
		intUsed[INT_INT1] = INT_USED;
		intFunction[INT_INT1] = func;
		INTCON2bits.INTEDG1 = config;
		INTCON2bits.RBPU = 0;						// PORTB pull-ups are enabled
		TRISBbits.TRISB1 = INPUT;
		INTCON3bits.INT1IP = INT_LOW_PRIORITY;
		INTCON3bits.INT1IE = INT_ENABLE;
		INTCON3bits.INT1IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt INT1 is already used !");
	}
	#endif
}
#endif

#ifdef INT2INT
void OnChangePin2(callback func, u8 config)
{
	if (intUsed[INT_INT2] == INT_NOT_USED)
	{
		intUsed[INT_INT2] = INT_USED;
		intFunction[INT_INT2] = func;
		INTCON2bits.INTEDG2 = config;
		INTCON2bits.RBPU = 0;						// PORTB pull-ups are enabled
		TRISBbits.TRISB2 = INPUT;
		INTCON3bits.INT2IP = INT_LOW_PRIORITY;
		INTCON3bits.INT2IE = INT_ENABLE;
		INTCON3bits.INT2IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt INT2 is already used !");
	}
	#endif
}
#endif

#ifdef RBINT
/*
PORTB<7:4> Interrupt-on-Change
Only pins configured as inputs can
cause this interrupt to occur. Any RB7:RB4 pin
configured as an output is excluded from the interrupt-
on-change comparison. The pins are compared with
the old value latched on the last read of PORTB.
*/

void OnChangePin4to7(callback func, u8 pin)
{
	if (intUsed[INT_RB] == INT_NOT_USED)
	{
		intUsed[INT_RB] = INT_USED;
		intFunction[INT_RB] = func;
		INTCON2bits.INTEDG2 = config;
		TRISB |= (1 << pin);	// pin as an INPUT
		INTCON2bits.RBIP = INT_LOW_PRIORITY;
		INTCONbits.RBIE = INT_ENABLE;
		INTCONbits.RBIF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt RB is already used !");
	}
	#endif
}
#endif

/*	----------------------------------------------------------------------------
	---------- OnCompare
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		Configure compare interrupt mode
	@param		inter:		interrupt number
				func:		function called when interrupt occured
	--------------------------------------------------------------------------*/

#ifdef CCP1INT
void OnCompare1(callback func, u8 config)
{
	if (intUsed[INT_CCP1] == INT_NOT_USED)
	{
		intUsed[INT_CCP1] = INT_USED;
		intFunction[INT_CCP1] = func;
		IPR1bits.CCP1IP = INT_LOW_PRIORITY;
		PIE1bits.CCP1IE = INT_ENABLE;
		CCP1CON &= config;
		PIR1bits.CCP1IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt CCP1 is already used !");
	}
	#endif
}
#endif

#ifdef CCP2INT
void OnCompare2(callback func, u8 config)
{
	if (intUsed[INT_CCP2] == INT_NOT_USED)
	{
		intUsed[INT_CCP2] = INT_USED;
		intFunction[INT_CCP2] = func;
		IPR2bits.CCP2IP = INT_LOW_PRIORITY;
		PIE2bits.CCP2IE = INT_ENABLE;
		CCP2CON &= config;
		PIR2bits.CCP2IF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt CCP2 is already used !");
	}
	#endif
}
#endif

#ifdef CMINT
void OnCompareAll(callback func, u8 config)
{
	if (intUsed[INT_CM] == INT_NOT_USED)
	{
		intUsed[INT_CM] = INT_USED;
		intFunction[INT_CM] = func;
		IPR2bits.CMIP = INT_LOW_PRIORITY;
		PIE2bits.CMIE = INT_ENABLE;
		PIR2bits.CMIF = 0;
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt CM is already used !");
	}
	#endif
}
#endif

/*	----------------------------------------------------------------------------
	---------- OnEvent
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		Configure interrupt event
	@param		inter:		interrupt number
				func:		function called when interrupt occured
	--------------------------------------------------------------------------*/

#ifdef RCINT || TXINT || ADINT || OSCFINT || EEINT || HLVDINT || BCLINT || USBINT
void OnEvent(u8 inter, callback func)
{
	if (intUsed[inter] == INT_NOT_USED)
	{
		intUsed[inter] = INT_USED;
		intFunction[inter] = func;

		switch(inter)
		{
			case INT_RC:					// serial rx
				PIR1bits.RCIF = 0;
				break;
			case INT_TX:					// serial tx
				PIR1bits.TXIF = 0;
				break;
			case INT_AD:					// ad conversion complete
				PIR1bits.ADIF = 0;
				break;
			case INT_OSCF:					// oscillator failed
				PIR2bits.OSCFIF = 0;
				break;
			case INT_EE:					// eeprom write operation
				PIR2bits.EEIF = 0;
				break;
			case INT_HLVD:					// high/low voltage detect
				PIR2bits.HLVDIF = 0;
				break;
			case INT_BCL:					// bus collision
				PIR2bits.BCLIF = 0;
				break;
			case INT_USB:					// usb 
				PIR2bits.USBIF = 0;
				break;
			case INT_SSP:				
				#ifdef PIC18F4550
				PIR1bits.SSPIF = 0;
				#endif
				break;
		}
	}
	#ifdef DEBUG
	else
	{
		serial_printf("Error : interrupt #%u is already used !", inter);
	}
	#endif
}
#endif

#ifdef RCINT
void OnSerialRX(callback func)	{	OnEvent(INT_RC, func);	}
#endif

#ifdef TXINT
void OnSerialTX(callback func)	{	OnEvent(INT_TX, func);	}
#endif

#ifdef ADINT
void OnADC(callback func)		{	OnEvent(INT_AD, func);	}
#endif

#ifdef OSCFINT
void OnOscFailed(callback func)	{	OnEvent(INT_OSCF, func);}
#endif

#ifdef EEINT
void OnEeprom(callback func)	{	OnEvent(INT_EE, func);	}
#endif

#ifdef HLVDINT
void OnLowVoltage(callback func){	OnEvent(INT_HLVD, func);}
#endif

#ifdef BCLINT
void OnBusCol(callback func)	{	OnEvent(INT_BCL, func);	}
#endif

#ifdef USBINT
void OnUSB(callback func)		{	OnEvent(INT_USB, func);	}
#endif

#ifdef SSPINT
void OnParallel(callback func)	{	OnEvent(INT_SSP, func);	}
#endif

/*	----------------------------------------------------------------------------
	---------- userhighinterrupt
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		function called by high_priority_isr
	@param		none
	--------------------------------------------------------------------------*/

void userhighinterrupt()
{
	#ifdef INT0INT
	if (INTCONbits.INT0IE && INTCONbits.INT0IF)
	{
		intFunction[INT_INT0]();
		INTCONbits.INT0IF = 0;
	}
	#endif
}

/*	----------------------------------------------------------------------------
	---------- userinterrupt
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		function called by low_priority_isr
	@param		none
	--------------------------------------------------------------------------*/

void userinterrupt()
{
	#ifdef INT1INT
	if (INTCON3bits.INT1IE && INTCON3bits.INT1IF)
	{
		INTCON3bits.INT1IF = 0;
		intFunction[INT_INT1]();
	}
	#endif
	#ifdef INT2INT
	if (INTCON3bits.INT2IE && INTCON3bits.INT2IF)
	{
		INTCON3bits.INT2IF = 0;
		intFunction[INT_INT2]();
	}
	#endif
	#ifdef RBINT
	if (INTCONbits.RBIE && INTCONbits.RBIF)
	{
		INTCONbits.RBIF = 0;
		intFunction[INT_RB]();
	}
	#endif
	#ifdef TMR0INT || CNTR0INT
	if (INTCONbits.TMR0IE && INTCONbits.TMR0IF)
	{
		TMR0H = preloadH[INT_TMR0];
		TMR0L = preloadL[INT_TMR0];
		INTCONbits.TMR0IF = 0;
		if (intCount[INT_TMR0]++ >= intCountLimit[INT_TMR0])
		{
			intCount[INT_TMR0] = 0;
			intFunction[INT_TMR0]();
		}
	}
	#endif
	#ifdef TMR1INT || CNTR1INT
	if (PIE1bits.TMR1IE && PIR1bits.TMR1IF)
	{
		TMR1H = preloadH[INT_TMR1];
		TMR1L = preloadL[INT_TMR1];
		PIR1bits.TMR1IF = 0;
		if (intCount[INT_TMR1]++ >= intCountLimit[INT_TMR1])
		{
			intCount[INT_TMR1] = 0;
			intFunction[INT_TMR1]();
		}
	}
	#endif
	#ifdef TMR2INT
	if (PIE1bits.TMR2IE && PIR1bits.TMR2IF)
	{
		PIR1bits.TMR2IF = 0;
		if (intCount[INT_TMR2]++ >= intCountLimit[INT_TMR2])
		{
			intCount[INT_TMR2] = 0;
			intFunction[INT_TMR2]();
		}
		// NB : no need to reload PR2
	}
	#endif
	#ifdef TMR3INT || CNTR3INT
	if (PIE2bits.TMR3IE && PIR2bits.TMR3IF)
	{
		TMR3H = preloadH[INT_TMR3];
		TMR3L = preloadL[INT_TMR3];
		PIR2bits.TMR3IF = 0;
		if (intCount[INT_TMR3]++ >= intCountLimit[INT_TMR3])
		{
			intCount[INT_TMR3] = 0;
			intFunction[INT_TMR3]();
		}
	}
	#endif
	#ifdef ADINT
	if (PIE1bits.ADIE && PIR1bits.ADIF)
	{
		PIR1bits.ADIF = 0;
		intFunction[INT_AD]();
	}
	#endif
	#ifdef RCINT
	if (PIE1bits.RCIE && PIR1bits.RCIF)
	{
		PIR1bits.RCIF = 0;
		intFunction[INT_RC]();
	}
	#endif
	#ifdef TXINT
	if (PIE1bits.TXIE && PIR1bits.TXIF)
	{
		PIR1bits.TXIF = 0;
		intFunction[INT_TX]();
	}
	#endif
	#ifdef CCP1INT
	if (PIE1bits.CCP1IE && PIR1bits.CCP1IF)
	{
		PIR1bits.CCP1IF = 0;
		intFunction[INT_CCP1]();
	}
	#endif
	#ifdef CCP2INT
	if (PIE2bits.CCP2IE && PIR2bits.CCP2IF)
	{
		PIR2bits.CCP2IF = 0;
		intFunction[INT_CCP2]();
	}
	#endif
	#ifdef EEINT
	if (PIE2bits.EEIE && PIR2bits.EEIF)
	{
		PIR2bits.EEIF = 0;
		intFunction[INT_EE]();
	}
	#endif
	#ifdef USBINT
	if (PIE2bits.USBIE && PIR2bits.USBIF)
	{
		PIR2bits.USBIF = 0;
		intFunction[INT_USB]();
	}
	#endif
	#ifdef OSCFINT
	if (PIE2bits.OSCFIE && PIR2bits.OSCFIF)
	{
		PIR2bits.OSCFIF = 0;
		intFunction[INT_OSCF]();
	}
	#endif
	#ifdef CMINT
	if (PIE2bits.CMIE && PIR2bits.CMIF)
	{
		PIR2bits.CMIF = 0;
		intFunction[INT_CM]();
	}
	#endif
	#ifdef BCLINT
	if (PIE2bits.BCLIE && PIR2bits.BCLIF)
	{
		PIR2bits.BCLIF = 0;
		intFunction[INT_BCL]();
	}
	#endif
	#ifdef HLVDINT
	if (PIE2bits.HLVDIE && PIR2bits.HLVDIF)
	{
		PIR2bits.HLVDIF = 0;
		intFunction[INT_HLVD]();
	}
	#endif
	#ifdef PIC18F4550
	#ifdef SSPINT
	if (PIE1bits.SSPIE && PIR1bits.SSPIF)
	{
		PIR1bits.SSPIF = 0;
		intFunction[INT_SSP]();
	}
	#endif
	#endif
}

/*	----------------------------------------------------------------------------
	---------- detachInterrupt
	----------------------------------------------------------------------------
	@author		Regis Blanchot <rblanchot@gmail.com>
	@descr		Disable the interrupt
	@param		inter:		interrupt number
	--------------------------------------------------------------------------*/

void detachInterrupt(u8 inter)
{
	intUsed[inter] = INT_NOT_USED;	// This interrupt is no longer used

	switch(inter)
	{
		case INT_INT0:
			INTCONbits.INT0IE = INT_DISABLE;
			break;
		case INT_INT1:
			INTCON3bits.INT1IE = INT_DISABLE;
			break;
		case INT_INT2:
			INTCON3bits.INT2IE = INT_DISABLE;
			break;
		case INT_TMR0:
			INTCONbits.TMR0IE = INT_DISABLE;
			break;
		case INT_TMR1:
			PIE1bits.TMR1IE = INT_DISABLE;
			break;
		case INT_TMR2:
			PIE1bits.TMR2IE = INT_DISABLE;
			break;
		case INT_TMR3:
			PIE2bits.TMR3IE = INT_DISABLE;
			break;
		case INT_RB:
			INTCONbits.RBIE = INT_DISABLE;
			break;
		case INT_USB:
			PIE2bits.USBIE = INT_DISABLE;
			break;
		case INT_AD:
			PIE1bits.ADIE = INT_DISABLE;
			break;
		case INT_RC:
			PIE1bits.RCIE = INT_DISABLE;
			break;
		case INT_TX:
			PIE1bits.TXIE = INT_DISABLE;
			break;
		case INT_CCP1:
			PIE1bits.CCP1IE = INT_DISABLE;
			break;
		case INT_CCP2:
			PIE2bits.CCP2IE = INT_DISABLE;
			break;
		case INT_OSCF:
			PIE2bits.OSCFIE = INT_DISABLE;
			break;
		case INT_CM:
			PIE2bits.CMIE = INT_DISABLE;
			break;
		case INT_EE:
			PIE2bits.EEIE = INT_DISABLE;
			break;
		case INT_BCL:
			PIE2bits.BCLIE = INT_DISABLE;
			break;
		case INT_HLVD:
			PIE2bits.HLVDIE = INT_DISABLE;
			break;
		case INT_SSP:
			#ifdef PIC18F4550
			PIE1bits.SSPIE = INT_DISABLE;
			#endif
			break;
	}
}

/*	----------------------------------------------------------------------------
	---------- init_INT
	----------------------------------------------------------------------------
	@author		Régis Blanchot <rblanchot@gmail.com>
	@descr		Disable all the interrupt
	@param		inter:		interrupt number
	--------------------------------------------------------------------------*/

void int_init()
{
	u8 i;
	
	for (i = 0; i < INT_NUM; i++)
		detachInterrupt(i);
}

#endif
